Core/src/AccumulationRegisters/РасчетыСПокупателями/РасчетыСПокупателями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПокупателями</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРег</name>
    <comment>Сумма в регламентированной валюте</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРасчетов</name>
    <type>
      <types>EnumRef.ТипыРасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПередачаВА</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.ПоступлениеВКассу</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
      <types>DocumentRef.Взаимозачет</types>
      <types>DocumentRef.ПоступлениеНаСчет</types>
      <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/Enums/ТипыРасчетов/ТипыРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРасчетов</name>
  <enumValues>
    <name>Долг</name>
  </enumValues>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
</mdclass:Enum>

Core/src/CommonModules/AzRyРаботаСДокументамыМодульПроведения/Module.bsl
#Область ЧекККМ

Процедура ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, Движения) Экспорт 
		
	Если ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
		ОтразитьРасчетыСПокупателямиЧекККМ(ДополнительныеСвойства, Движения);
	ИначеЕсли ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда	
		ОтразитьРасчетыСПокупателямиОтчетОРозничныхПродажах(ДополнительныеСвойства, Движения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтразитьРасчетыСПокупателямиЧекККМ(ДополнительныеСвойства, Движения)
	
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	//Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
	//	
	//	Если Не (ДополнительныеСвойства.ДляПроведения.ЧекПробит И (Не ДополнительныеСвойства.ДляПроведения.Архивный)) Тогда
	//		Возврат;
	//	КонецЕсли; 
	//	
	//	Движения.РасчетыСПокупателями.Записывать = Истина;
	//	
	//	Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Запасы Цикл						
	//		Движение = Движения.РасчетыСПокупателями.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//		Движение.Период      = ДокументСсылка.Дата;
	//		Движение.Организация = ДокументСсылка.Организация;
	//		Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
	//		Движение.Контрагент  = ДокументСсылка.Контрагент;
	//		Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
	//		Движение.Документ    = ДокументСсылка;
	//		Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
	//		Движение.Сумма       = ТекСтрока.Сумма;
	//		Движение.СуммаВал    = ТекСтрока.Сумма;
	//		Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";	
	//		
	//		Если ДополнительныеСвойства.ДляПроведения.Ссылка.AzRyВидыОперацийЧекККМ <> Перечисления.AzRyВидыОперацийЧекККМ.Терминалом Тогда		
	//			Движение = Движения.РасчетыСПокупателями.Добавить();
	//			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//			Движение.Период      = ДокументСсылка.Дата;
	//			Движение.Организация = ДокументСсылка.Организация;
	//			Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
	//			Движение.Контрагент  = ДокументСсылка.Контрагент;
	//			Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
	//			Движение.Документ    = ДокументСсылка;
	//			Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
	//			Движение.Сумма       = ТекСтрока.Сумма;
	//			Движение.СуммаВал    = ТекСтрока.Сумма;
	//			Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";
	//		КонецЕсли; 
	//		
	//		Если ДополнительныеСвойства.ДляПроведения.Ссылка.AzRyВидыОперацийЧекККМ = Перечисления.AzRyВидыОперацийЧекККМ.РасходнаяНакладнаяПлатежнаяКарта Тогда				
	//			Движение = Движения.РасчетыСПокупателями.Добавить();
	//			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//			Движение.Период      = ДокументСсылка.Дата;
	//			Движение.Организация = ДокументСсылка.Организация;
	//			Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
	//			Движение.Контрагент  = Справочники.AzRyНастройки.ЧекККМКонтрагентТерминал.Значение;
	//			Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
	//			Движение.Документ    = ДокументСсылка;
	//			Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
	//			Движение.Сумма       = ТекСтрока.Сумма;
	//			Движение.СуммаВал    = ТекСтрока.Сумма;
	//			Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";		
	//		КонецЕсли; 
	//	КонецЦикла;
	//	
	//	Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.ОплатаПлатежнымиКартами Цикл						
	//		Движение = Движения.РасчетыСПокупателями.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//		Движение.Период      = ДокументСсылка.Дата;
	//		Движение.Организация = ДокументСсылка.Организация;
	//		Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
	//		Движение.Контрагент  = ДокументСсылка.Контрагент;
	//		Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
	//		Движение.Документ    = ДокументСсылка;
	//		Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
	//		Движение.Сумма       = ТекСтрока.Сумма;
	//		Движение.СуммаВал    = ТекСтрока.Сумма;
	//		Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";	
	//		
	//		Если ДополнительныеСвойства.ДляПроведения.Ссылка.AzRyВидыОперацийЧекККМ <> Перечисления.AzRyВидыОперацийЧекККМ.Терминалом Тогда
	//			Движение = Движения.РасчетыСПокупателями.Добавить();
	//			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//			Движение.Период      = ДокументСсылка.Дата;
	//			Движение.Организация = ДокументСсылка.Организация;
	//			Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
	//			Движение.Контрагент  = ДокументСсылка.Контрагент;
	//			Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
	//			Движение.Документ    = ДокументСсылка;
	//			Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
	//			Движение.Сумма       = ТекСтрока.Сумма;
	//			Движение.СуммаВал    = ТекСтрока.Сумма;
	//			Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";
	//		КонецЕсли;
	//		
	//		Если ДополнительныеСвойства.ДляПроведения.Ссылка.AzRyВидыОперацийЧекККМ = Перечисления.AzRyВидыОперацийЧекККМ.РасходнаяНакладнаяПлатежнаяКарта Тогда				
	//			Движение = Движения.РасчетыСПокупателями.Добавить();
	//			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//			Движение.Период      = ДокументСсылка.Дата;
	//			Движение.Организация = ДокументСсылка.Организация;
	//			Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
	//			Движение.Контрагент  = Справочники.AzRyНастройки.ЧекККМКонтрагентТерминал.Значение;
	//			Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
	//			Движение.Документ    = ДокументСсылка;
	//			Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
	//			Движение.Сумма       = ТекСтрока.Сумма;
	//			Движение.СуммаВал    = ТекСтрока.Сумма;
	//			Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";		
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	// ანალიტიკისთვის
	//	
	//	Движения.AzRyАналитикаРасчетыСПокупателями.Записывать = Истина;
	//	
	//	Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Запасы Цикл						
	//		Движение = Движения.AzRyАналитикаРасчетыСПокупателями.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//		Движение.Период      = ДокументСсылка.Дата;
	//		Движение.Организация = ДокументСсылка.Организация;
	//		Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
	//		Движение.Контрагент  = ДокументСсылка.AzRyАналитикаКонтрагент;
	//		Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
	//		Движение.Документ    = ДокументСсылка;
	//		Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
	//		Движение.Сумма       = ТекСтрока.Сумма;
	//		Движение.СуммаВал    = ТекСтрока.Сумма;
	//		Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";	
	//		
	//		Движение = Движения.AzRyАналитикаРасчетыСПокупателями.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		Движение.Период      = ДокументСсылка.Дата;
	//		Движение.Организация = ДокументСсылка.Организация;
	//		Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
	//		Движение.Контрагент  = ДокументСсылка.AzRyАналитикаКонтрагент;
	//		Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
	//		Движение.Документ    = ДокументСсылка;
	//		Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
	//		Движение.Сумма       = ТекСтрока.Сумма;
	//		Движение.СуммаВал    = ТекСтрока.Сумма;
	//		Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";	
	//	КонецЦикла;
	//	
	//	//Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.ОплатаПлатежнымиКартами Цикл						
	//	//	Движение = Движения.AzRyАналитикаРасчетыСПокупателями.Добавить();
	//	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	//	Движение.Период      = ДокументСсылка.Дата;
	//	//	Движение.Организация = ДокументСсылка.Организация;
	//	//	Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
	//	//	Движение.Контрагент  = ДокументСсылка.AzRyАналитикаКонтрагент;
	//	//	Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
	//	//	Движение.Документ    = ДокументСсылка;
	//	//	Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
	//	//	Движение.Сумма       = ТекСтрока.Сумма;
	//	//	Движение.СуммаВал    = ТекСтрока.Сумма;
	//	//	Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";	
	//	//	
	//	//	Движение = Движения.AzRyАналитикаРасчетыСПокупателями.Добавить();
	//	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	//	Движение.Период      = ДокументСсылка.Дата;
	//	//	Движение.Организация = ДокументСсылка.Организация;
	//	//	Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
	//	//	Движение.Контрагент  = ДокументСсылка.AzRyАналитикаКонтрагент;
	//	//	Движение.Договор     = ДокументСсылка.AzRyЗаказПокупателя.Договор;
	//	//	Движение.Документ    = ДокументСсылка;
	//	//	Движение.Заказ       = ДокументСсылка.AzRyЗаказПокупателя;
	//	//	Движение.Сумма       = ТекСтрока.Сумма;
	//	//	Движение.СуммаВал    = ТекСтрока.Сумма;
	//	//	Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა";			
	//	//КонецЦикла;
	//	
	//КонецЕсли;	

КонецПроцедуры
 
Процедура ОтразитьРасчетыСПокупателямиОтчетОРозничныхПродажах(ДополнительныеСвойства, Движения)

	Движения.РасчетыСПокупателями.Записывать = Истина;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка; 
	Для каждого ТекСтрока Из ДополнительныеСвойства.ДляПроведения.Ссылка.Запасы Цикл						
		Движение = Движения.РасчетыСПокупателями.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период      = ДокументСсылка.Дата;
		Движение.Организация = ДокументСсылка.Организация;
		Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
		Движение.Контрагент  = ТекСтрока.AzRyКонтрагент;
		Движение.AzRyАналитикаКонтрагент  = ТекСтрока.AzRyАналитикаКонтрагент;
		Движение.Договор     = ТекСтрока.AzRyЗаказПокупателя.Договор;
		Движение.Документ    = ДокументСсылка;
		Движение.Заказ       = ТекСтрока.AzRyЗаказПокупателя;
		Движение.Сумма       = ТекСтрока.Сумма;
		Движение.СуммаВал    = ТекСтрока.Сумма;
		Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა (AzRy)";
		
		//Если ТекСтрока.AzRyФормаОплаты <> Перечисления.ТипыДенежныхСредств.Безналичные Тогда
			Движение = Движения.РасчетыСПокупателями.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период      = ДокументСсылка.Дата;
			Движение.Организация = ДокументСсылка.Организация;
			Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
			Движение.Контрагент  = ТекСтрока.AzRyКонтрагент;
			Движение.AzRyАналитикаКонтрагент  = ТекСтрока.AzRyАналитикаКонтрагент;
			Движение.Договор     = ТекСтрока.AzRyЗаказПокупателя.Договор;
			Движение.Документ    = ДокументСсылка;
			Движение.Заказ       = ТекСтрока.AzRyЗаказПокупателя;
			Движение.Сумма       = ТекСтрока.Сумма;
			Движение.СуммаВал    = ТекСтрока.Сумма;
			Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა (AzRy)";
		//КонецЕсли;
		
		//Если ТекСтрока.AzRyФормаОплаты = Перечисления.ТипыДенежныхСредств.AzRyРасходнаяНакладнаяБезналичные Тогда				
		//	Движение = Движения.РасчетыСПокупателями.Добавить();
		//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		//	Движение.Период      = ДокументСсылка.Дата;
		//	Движение.Организация = ДокументСсылка.Организация;
		//	Движение.ТипРасчетов = Перечисления.ТипыРасчетов.Долг;
		//	Движение.Контрагент  = ТекСтрока.AzRyКонтрагент;
		//	Движение.AzRyАналитикаКонтрагент  = ТекСтрока.AzRyАналитикаКонтрагент;
		//	Движение.Договор     = ТекСтрока.AzRyЗаказПокупателя.Договор;
		//	Движение.Документ    = ДокументСсылка;
		//	Движение.Заказ       = ТекСтрока.AzRyЗаказПокупателя;
		//	Движение.Сумма       = ТекСтрока.Сумма;
		//	Движение.СуммаВал    = ТекСтрока.Сумма;
		//	Движение.СодержаниеПроводки = "მყიდველის ვალდებულებების წარმოშობა (AzRy)";	
		//КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
